ChangeRingKeyword see اطبع
ChangeRingKeyword give ادخل
ChangeRingKeyword if لو
ChangeRingKeyword but امالو
ChangeRingKeyword else عداذلك
ChangeRingKeyword ok تمام

سطرجديد = nl

اطبع "السلام عليكم ورحمة الله وبركاته" + سطرجديد

اطبع "كم عمرك" + سطرجديد
ادخل العمر

العمر = 0 + العمر
لو العمر < 10
        اطبع "اسمك ايه ياجميل؟" + سطرجديد
امالو العمر < 30
        اطبع "اسمك ايه ياابو الشباب؟" + سطرجديد 
امالو العمر < 60
        اطبع "اسم حضرتك ايه؟" +سطرجديد
عداذلك
        اطبع "والله حضرتك منورنا ... اتشرف ب اسم حضرتك؟" + سطرجديد
تمام

ادخل الاسم
اطبع " اهلا وسهلا يا: " + الاسم
